99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_rpc.c
#include "esp32_mquickjs_rpc.h"

#include "esp32_mquickjs_core.h"
#include "esp32_mquickjs_fs_events.h"
#include "esp32_mquickjs_options.h"
#include "esp32_mquickjs_memory.h"
#include "utils/esp32_mquickjs_byte_source.h"
#include "esp32qjs_rpc_wire.h"

#include <math.h>
#include <errno.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <sys/stat.h>
#include <unistd.h>

#include "cbor.h"
#include "esp_timer.h"

#define RPC_DECODER_SLOTS 4U
#define RPC_CODEC_SLOTS 2U
#define RPC_CODEC_FIELDS 256U
#define RPC_CODEC_FIELD_BYTES 64U
#define RPC_CODEC_TOTAL_FIELD_BYTES 8192U
#define RPC_CBOR_DEPTH 16U
#define RPC_SAFE_INTEGER 9007199254740991.0
#define RPC_STREAM_DIRECTORY_BYTES 96U
#define RPC_STREAM_PATH_BYTES 160U
#define RPC_FILE_SOURCE_CHUNK_BYTES 4096U
#define RPC_BUFFER_INITIAL_BYTES 256U
#define RPC_STREAM_SEGMENT_BYTES 4096U
#define RPC_STREAM_MAX_RECORD_BYTES \
    (ESP32_MQUICKJS_RPC_HEADER_BYTES + RPC_STREAM_SEGMENT_BYTES + \
     ESP32_MQUICKJS_RPC_CRC_BYTES)
#define RPC_STREAM_MAX_FRAME_BYTES \
    (RPC_STREAM_MAX_RECORD_BYTES + (RPC_STREAM_MAX_RECORD_BYTES / 254U) + 2U)

typedef struct rpc_file_source_object rpc_file_source_object_t;
typedef struct rpc_codec_slot rpc_codec_slot_t;

typedef struct {
    uint8_t slot;
    uint32_t generation;
} rpc_handle_ref_t;

typedef struct {
    rpc_file_source_object_t *owner;
    FILE *file;
    uint8_t buffer[RPC_FILE_SOURCE_CHUNK_BYTES];
} rpc_file_source_iterator_t;

typedef struct {
    JSContext *ctx;
    JSGCRef source_ref;
    bool rooted;
    bool opened;
    bool consumed;
    bool destroy_requested;
    uint16_t opcode;
    uint32_t request_id;
    uint8_t flags;
    uint8_t *prefix;
    size_t prefix_len;
    size_t source_len;
    size_t logical_offset;
    size_t source_produced;
    esp32_mquickjs_byte_span_source_t source;
    esp32_mquickjs_byte_span_t span;
    size_t span_offset;
    uint8_t segment[RPC_STREAM_SEGMENT_BYTES];
    uint8_t frame[RPC_STREAM_MAX_FRAME_BYTES];
} rpc_encoded_stream_object_t;

struct rpc_file_source_object {
    char *path;
    size_t length;
    uint32_t crc32;
    bool has_crc32;
    bool remove_on_destroy;
    bool adopted;
    bool opened;
    bool consumed;
    bool destroy_requested;
};

typedef struct {
    bool used;
    uint32_t generation;
    rpc_codec_slot_t *codec;
    /* Allocate the frame buffer only for live decoders, preferably in PSRAM. */
    esp32_mquickjs_rpc_wire_decoder_t *wire;
    FILE *stream_file;
    char stream_path[RPC_STREAM_PATH_BYTES];
    size_t stream_received;
    size_t stream_expected;
    uint32_t stream_crc_state;
    uint32_t messages;
    uint32_t errors;
} rpc_decoder_slot_t;

struct rpc_codec_slot {
    bool used;
    bool close_pending;
    uint32_t generation;
    bool allow_string_keys;
    char **fields;
    bool *dynamic_fields;
    size_t field_count;
    char stream_directory[RPC_STREAM_DIRECTORY_BYTES];
    uint32_t decoders;
};

typedef struct {
    uint8_t *data;
    size_t length;
    size_t capacity;
    bool failed;
    bool out_of_memory;
    bool sealed;
    bool has_stream;
    size_t stream_length;
    JSGCRef stream_ref;
    bool stream_rooted;
} rpc_buffer_t;

typedef struct {
    char *name;
    uint32_t field_id;
    bool integer_key;
    uint8_t encoded_key[9];
    size_t encoded_key_len;
} rpc_map_key_t;

typedef struct {
    JSContext *ctx;
    JSValue *messages;
    rpc_decoder_slot_t *slot;
    uint32_t message_index;
    bool failed;
} rpc_feed_context_t;

static rpc_decoder_slot_t s_rpc_decoders[RPC_DECODER_SLOTS];
static rpc_codec_slot_t s_rpc_codecs[RPC_CODEC_SLOTS];

static bool rpc_file_source_next(JSContext *ctx,
                                 void *opaque,
                                 esp32_mquickjs_byte_span_t *out)
{
    rpc_file_source_iterator_t *iterator = opaque;
    size_t length;

    if (iterator == NULL || iterator->file == NULL || iterator->owner == NULL) {
        JS_ThrowReferenceError(ctx, "RPC file source iterator is closed");
        return false;
    }
    length = fread(iterator->buffer, 1, sizeof(iterator->buffer), iterator->file);
    if (length == 0) {
        if (ferror(iterator->file)) {
            JS_ThrowInternalError(ctx, "RPC file source read failed");
        }
        return false;
    }
    out->data = iterator->buffer;
    out->length = length;
    out->owner = JS_UNDEFINED;
    out->dma_capable = false;
    return true;
}

static void rpc_file_source_iterator_close(JSContext *ctx, void *opaque)
{
    rpc_file_source_iterator_t *iterator = opaque;
    rpc_file_source_object_t *owner;

    (void)ctx;
    if (iterator == NULL) {
        return;
    }
    owner = iterator->owner;
    if (iterator->file != NULL) {
        fclose(iterator->file);
    }
    if (owner != NULL) {
        owner->opened = false;
        owner->consumed = true;
        if (owner->destroy_requested) {
            if (owner->remove_on_destroy && !owner->adopted && owner->path != NULL) {
                unlink(owner->path);
            }
            free(owner->path);
            free(owner);
        }
    }
    free(iterator);
}

static bool rpc_file_source_open(JSContext *ctx,
                                 JSValue source_value,
                                 void *opaque,
                                 esp32_mquickjs_byte_span_source_t *out,
                                 JSValue *out_error)
{
    rpc_file_source_object_t *source = opaque;
    rpc_file_source_iterator_t *iterator;

    (void)source_value;
    if (source == NULL || source->path == NULL || source->opened ||
        source->consumed || source->destroy_requested || source->adopted) {
        *out_error = JS_ThrowReferenceError(
            ctx, "RPC file ByteSpanSource is closed or has already been consumed");
        return false;
    }
    iterator = calloc(1, sizeof(*iterator));
    if (iterator == NULL) {
        *out_error = JS_ThrowOutOfMemory(ctx);
        return false;
    }
    iterator->file = fopen(source->path, "rb");
    if (iterator->file == NULL) {
        free(iterator);
        *out_error = JS_ThrowInternalError(ctx, "RPC file source could not be opened");
        return false;
    }
    iterator->owner = source;
    source->opened = true;
    out->opaque = iterator;
    out->next = rpc_file_source_next;
    out->close = rpc_file_source_iterator_close;
    return true;
}

