99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_rpc.c
static size_t rpc_file_source_known_length(void *opaque)
{
    rpc_file_source_object_t *source = opaque;
    return source == NULL || source->adopted ? 0 : source->length;
}

static void rpc_file_source_destroy(JSContext *ctx, void *opaque)
{
    rpc_file_source_object_t *source = opaque;

    (void)ctx;
    if (source == NULL) {
        return;
    }
    if (source->opened) {
        source->destroy_requested = true;
        return;
    }
    if (source->remove_on_destroy && !source->adopted && source->path != NULL) {
        unlink(source->path);
    }
    free(source->path);
    free(source);
}

static const esp32_mquickjs_byte_span_source_object_ops_t s_rpc_file_source_ops = {
    .class_id = JS_CLASS_BYTE_SPAN_SOURCE,
    .open = rpc_file_source_open,
    .known_length = rpc_file_source_known_length,
    .destroy = rpc_file_source_destroy,
};

static JSValue rpc_new_file_source(JSContext *ctx,
                                   const char *path,
                                   size_t length,
                                   bool remove_on_destroy,
                                   bool has_crc32,
                                   uint32_t crc32)
{
    rpc_file_source_object_t *source;
    size_t path_len;

    if (path == NULL) {
        return JS_ThrowInternalError(ctx, "RPC file source path is missing");
    }
    source = calloc(1, sizeof(*source));
    if (source == NULL) {
        return JS_ThrowOutOfMemory(ctx);
    }
    path_len = strlen(path);
    source->path = malloc(path_len + 1U);
    if (source->path == NULL) {
        free(source);
        return JS_ThrowOutOfMemory(ctx);
    }
    memcpy(source->path, path, path_len + 1U);
    source->length = length;
    source->remove_on_destroy = remove_on_destroy;
    source->has_crc32 = has_crc32;
    source->crc32 = crc32;
    return esp32_mquickjs_new_byte_span_source(
        ctx, JS_UNDEFINED, &s_rpc_file_source_ops, source);
}

static void rpc_decoder_stream_cleanup(rpc_decoder_slot_t *slot)
{
    if (slot == NULL) {
        return;
    }
    if (slot->stream_file != NULL) {
        fclose(slot->stream_file);
        slot->stream_file = NULL;
    }
    if (slot->stream_path[0] != '\0') {
        unlink(slot->stream_path);
        slot->stream_path[0] = '\0';
    }
    slot->stream_received = 0;
    slot->stream_expected = 0;
    slot->stream_crc_state = UINT32_C(0xffffffff);
}

static bool rpc_buffer_append(rpc_buffer_t *buffer, const void *data, size_t length)
{
    size_t required;

    if (buffer->failed || buffer->sealed ||
        length > ESP32_MQUICKJS_RPC_MESSAGE_BYTES - buffer->length) {
        buffer->failed = true;
        return false;
    }
    required = buffer->length + length;
    if (required > buffer->capacity) {
        size_t capacity = buffer->capacity == 0
                              ? RPC_BUFFER_INITIAL_BYTES
                              : buffer->capacity;
        uint8_t *grown;

        while (capacity < required) {
            capacity = capacity > ESP32_MQUICKJS_RPC_MESSAGE_BYTES / 2U
                           ? ESP32_MQUICKJS_RPC_MESSAGE_BYTES
                           : capacity * 2U;
        }
        grown = realloc(buffer->data, capacity);
        if (grown == NULL) {
            buffer->failed = true;
            buffer->out_of_memory = true;
            return false;
        }
        buffer->data = grown;
        buffer->capacity = capacity;
    }
    if (length != 0) {
        memcpy(buffer->data + buffer->length, data, length);
        buffer->length += length;
    }
    return true;
}

static void rpc_buffer_cleanup(JSContext *ctx, rpc_buffer_t *buffer)
{
    free(buffer->data);
    buffer->data = NULL;
    buffer->length = 0;
    buffer->capacity = 0;
    if (buffer->stream_rooted) {
        JS_DeleteGCRef(ctx, &buffer->stream_ref);
        buffer->stream_rooted = false;
    }
}

static bool rpc_buffer_byte(rpc_buffer_t *buffer, uint8_t value)
{
    return rpc_buffer_append(buffer, &value, 1);
}

static size_t rpc_encode_unsigned_bytes(uint8_t major, uint64_t value, uint8_t output[9])
{
    size_t i;
    if (value < 24U) {
        output[0] = (uint8_t)((major << 5U) | value);
        return 1;
    }
    if (value <= UINT8_MAX) {
        output[0] = (uint8_t)((major << 5U) | 24U);
        output[1] = (uint8_t)value;
        return 2;
    }
    if (value <= UINT16_MAX) {
        output[0] = (uint8_t)((major << 5U) | 25U);
        output[1] = (uint8_t)(value >> 8U);
        output[2] = (uint8_t)value;
        return 3;
    }
    if (value <= UINT32_MAX) {
        output[0] = (uint8_t)((major << 5U) | 26U);
        for (i = 0; i < 4; ++i) {
            output[1 + i] = (uint8_t)(value >> (24U - i * 8U));
        }
        return 5;
    }
    output[0] = (uint8_t)((major << 5U) | 27U);
    for (i = 0; i < 8; ++i) {
        output[1 + i] = (uint8_t)(value >> (56U - i * 8U));
    }
    return 9;
}

static bool rpc_encode_unsigned(rpc_buffer_t *buffer, uint8_t major, uint64_t value)
{
    uint8_t bytes[9];
    size_t length = rpc_encode_unsigned_bytes(major, value, bytes);
    return rpc_buffer_append(buffer, bytes, length);
}

static int rpc_field_id(const rpc_codec_slot_t *codec,
                        const char *name,
                        uint32_t *out_id)
{
    size_t i;
    if (codec == NULL || name == NULL || out_id == NULL) {
        return -1;
    }
    for (i = 0; i < codec->field_count; ++i) {
        if (strcmp(name, codec->fields[i]) == 0) {
            *out_id = (uint32_t)i;
            return 0;
        }
    }
    return -1;
}

static bool rpc_field_is_dynamic(const rpc_codec_slot_t *codec,
                                 uint32_t field_id)
{
    return codec != NULL && field_id < codec->field_count &&
           codec->dynamic_fields[field_id];
}

static int rpc_map_key_compare(const void *left_value, const void *right_value)
{
    const rpc_map_key_t *left = left_value;
    const rpc_map_key_t *right = right_value;
    uint8_t left_prefix[9];
    uint8_t right_prefix[9];
    size_t left_prefix_len;
    size_t right_prefix_len;
    int compared;
    if (left->encoded_key_len != right->encoded_key_len) {
        return left->encoded_key_len < right->encoded_key_len ? -1 : 1;
    }
    left_prefix_len = left->integer_key
        ? rpc_encode_unsigned_bytes(0, left->field_id, left_prefix)
        : rpc_encode_unsigned_bytes(3, strlen(left->name), left_prefix);
    right_prefix_len = right->integer_key
        ? rpc_encode_unsigned_bytes(0, right->field_id, right_prefix)
        : rpc_encode_unsigned_bytes(3, strlen(right->name), right_prefix);
    compared = memcmp(left_prefix, right_prefix,
                      left_prefix_len < right_prefix_len
                          ? left_prefix_len : right_prefix_len);
    if (compared == 0 && left_prefix_len != right_prefix_len) {
        compared = left_prefix_len < right_prefix_len ? -1 : 1;
    }
    if (compared == 0 && !left->integer_key && !right->integer_key) {
        compared = strcmp(left->name, right->name);
    }
    return compared < 0 ? -1 : compared > 0 ? 1 : 0;
}

static bool rpc_encode_value(JSContext *ctx,
                             const rpc_codec_slot_t *codec,
                             JSGCRef *value_ref,
                             rpc_buffer_t *buffer,
                             unsigned int depth,
                             bool string_keys_allowed);

static bool rpc_encode_array(JSContext *ctx,
                             const rpc_codec_slot_t *codec,
                             JSGCRef *value_ref,
                             rpc_buffer_t *buffer,
                             unsigned int depth,
                             bool string_keys_allowed)
{
    JSGCRef length_ref;
    JSValue *length_value = JS_PushGCRef(ctx, &length_ref);
    uint32_t length;
    uint32_t i;

    *length_value = JS_GetPropertyStr(ctx, value_ref->val, "length");
    if (JS_IsException(*length_value) || JS_ToUint32(ctx, &length, *length_value) != 0 ||
        !rpc_encode_unsigned(buffer, 4, length)) {
        JS_PopGCRef(ctx, &length_ref);
        return false;
    }
    JS_PopGCRef(ctx, &length_ref);
    for (i = 0; i < length; ++i) {
        JSGCRef item_ref;
        JSValue *item = JS_PushGCRef(ctx, &item_ref);
        *item = JS_GetPropertyUint32(ctx, value_ref->val, i);
        if (JS_IsException(*item) ||
            !rpc_encode_value(ctx, codec, &item_ref, buffer, depth + 1U,
                              string_keys_allowed)) {
            JS_PopGCRef(ctx, &item_ref);
            return false;
        }
        JS_PopGCRef(ctx, &item_ref);
    }
    return true;
}

static void rpc_free_map_keys(rpc_map_key_t *keys, size_t length)
{
    size_t i;
    for (i = 0; i < length; ++i) {
        free(keys[i].name);
    }
    free(keys);
}

static bool rpc_encode_map(JSContext *ctx,
                           const rpc_codec_slot_t *codec,
                           JSGCRef *value_ref,
                           rpc_buffer_t *buffer,
                           unsigned int depth,
                           bool string_keys_allowed)
{
    JSGCRef keys_ref;
    JSGCRef length_ref;
    JSValue *keys_array = JS_PushGCRef(ctx, &keys_ref);
    JSValue *length_value = JS_PushGCRef(ctx, &length_ref);
    rpc_map_key_t *keys = NULL;
    uint32_t length = 0;
    uint32_t i;
    bool ok = false;

    *keys_array = esp32_mquickjs_own_property_keys(ctx, value_ref->val);
    *length_value = JS_IsException(*keys_array)
                        ? JS_EXCEPTION
                        : JS_GetPropertyStr(ctx, *keys_array, "length");
    if (JS_IsException(*length_value) ||
        JS_ToUint32(ctx, &length, *length_value) != 0 || length > 1024U) {
        goto done;
    }
    keys = calloc(length == 0 ? 1U : length, sizeof(*keys));
    if (keys == NULL) {
        JS_ThrowOutOfMemory(ctx);
        goto done;
    }
    for (i = 0; i < length; ++i) {
        JSGCRef key_ref;
        JSValue *key_value = JS_PushGCRef(ctx, &key_ref);
        JSCStringBuf key_buf;
        const char *key;
        size_t key_len;

        *key_value = JS_GetPropertyUint32(ctx, *keys_array, i);
        key = JS_IsException(*key_value)
                  ? NULL
                  : JS_ToCStringLen(ctx, &key_len, *key_value, &key_buf);
        if (key == NULL || memchr(key, '\0', key_len) != NULL) {
            if (key != NULL && !JS_HasException(ctx)) {
                JS_ThrowTypeError(ctx,
                                  "RPCCodec.encode() map keys must not contain NUL");
            }
            JS_PopGCRef(ctx, &key_ref);
            goto done;
        }
        keys[i].name = malloc(key_len + 1U);
        if (keys[i].name == NULL) {
            JS_PopGCRef(ctx, &key_ref);
            JS_ThrowOutOfMemory(ctx);
            goto done;
        }
        memcpy(keys[i].name, key, key_len + 1U);
        keys[i].integer_key =
            rpc_field_id(codec, key, &keys[i].field_id) == 0;
        if (!keys[i].integer_key && !string_keys_allowed) {
            JS_PopGCRef(ctx, &key_ref);
            JS_ThrowTypeError(ctx,
                              "RPCCodec.encode() schema field has no integer key: %s",
                              keys[i].name);
            goto done;
        }
        if (keys[i].integer_key) {
            keys[i].encoded_key_len = rpc_encode_unsigned_bytes(
                0, keys[i].field_id, keys[i].encoded_key);
        } else {
            uint8_t prefix[9];
            size_t prefix_len = rpc_encode_unsigned_bytes(3, key_len, prefix);
            keys[i].encoded_key_len = prefix_len + key_len;
        }
        JS_PopGCRef(ctx, &key_ref);
    }
    if (string_keys_allowed) {
        for (i = 0; i < length; ++i) {
            uint32_t j;
            char field_id_key[16];
            int field_id_key_len;

