99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_rpc.c
            if (!keys[i].integer_key) {
                continue;
            }
            field_id_key_len = snprintf(field_id_key, sizeof(field_id_key),
                                        "%lu", (unsigned long)keys[i].field_id);
            if (field_id_key_len < 0 ||
                (size_t)field_id_key_len >= sizeof(field_id_key)) {
                JS_ThrowInternalError(ctx,
                                      "RPCCodec.encode() could not format a field id");
                goto done;
            }
            for (j = 0; j < length; ++j) {
                if (strcmp(keys[j].name, field_id_key) == 0) {
                    uint8_t prefix[9];
                    size_t key_len = strlen(keys[i].name);
                    size_t prefix_len =
                        rpc_encode_unsigned_bytes(3, key_len, prefix);
                    keys[i].integer_key = false;
                    keys[i].encoded_key_len = prefix_len + key_len;
                    break;
                }
            }
        }
    }
    qsort(keys, length, sizeof(*keys), rpc_map_key_compare);
    if (!rpc_encode_unsigned(buffer, 5, length)) {
        goto done;
    }
    for (i = 0; i < length; ++i) {
        JSGCRef item_ref;
        JSValue *item = JS_PushGCRef(ctx, &item_ref);
        if (keys[i].integer_key) {
            if (!rpc_encode_unsigned(buffer, 0, keys[i].field_id)) {
                JS_PopGCRef(ctx, &item_ref);
                goto done;
            }
        } else {
            size_t key_len = strlen(keys[i].name);
            if (!rpc_encode_unsigned(buffer, 3, key_len) ||
                !rpc_buffer_append(buffer, keys[i].name, key_len)) {
                JS_PopGCRef(ctx, &item_ref);
                goto done;
            }
        }
        *item = JS_GetPropertyStr(ctx, value_ref->val, keys[i].name);
        if (JS_IsException(*item) ||
            !rpc_encode_value(
                ctx, codec, &item_ref, buffer, depth + 1U,
                string_keys_allowed ||
                    (keys[i].integer_key &&
                     rpc_field_is_dynamic(codec, keys[i].field_id)))) {
            JS_PopGCRef(ctx, &item_ref);
            goto done;
        }
        JS_PopGCRef(ctx, &item_ref);
    }
    ok = true;

done:
    rpc_free_map_keys(keys, length);
    JS_PopGCRef(ctx, &length_ref);
    JS_PopGCRef(ctx, &keys_ref);
    return ok;
}

static bool rpc_encode_value(JSContext *ctx,
                             const rpc_codec_slot_t *codec,
                             JSGCRef *value_ref,
                             rpc_buffer_t *buffer,
                             unsigned int depth,
                             bool string_keys_allowed)
{
    if (depth > RPC_CBOR_DEPTH) {
        JS_ThrowRangeError(ctx, "RPCCodec.encode() payload exceeds the nesting limit");
        return false;
    }
    if (JS_IsNull(value_ref->val)) {
        return rpc_buffer_byte(buffer, 0xf6);
    }
    if (JS_IsBool(value_ref->val)) {
        return rpc_buffer_byte(buffer,
                               JS_VALUE_GET_SPECIAL_VALUE(value_ref->val) ? 0xf5 : 0xf4);
    }
    if (JS_IsNumber(ctx, value_ref->val)) {
        double number;
        if (JS_ToNumber(ctx, &number, value_ref->val) != 0 || !isfinite(number)) {
            JS_ThrowTypeError(ctx, "RPCCodec.encode() requires finite numbers");
            return false;
        }
        if (floor(number) == number && fabs(number) <= RPC_SAFE_INTEGER) {
            uint64_t encoded = number >= 0 ? (uint64_t)number : (uint64_t)(-1.0 - number);
            return rpc_encode_unsigned(buffer, number >= 0 ? 0 : 1, encoded);
        }
        {
            union { double number; uint64_t bits; } raw = { .number = number };
            uint8_t bytes[9];
            size_t i;
            bytes[0] = 0xfb;
            for (i = 0; i < 8; ++i) {
                bytes[1 + i] = (uint8_t)(raw.bits >> (56U - i * 8U));
            }
            return rpc_buffer_append(buffer, bytes, sizeof(bytes));
        }
    }
    if (JS_IsString(ctx, value_ref->val)) {
        JSCStringBuf string_buf;
        size_t length = 0;
        const char *string = JS_ToCStringLen(ctx, &length, value_ref->val, &string_buf);
        if (string == NULL) {
            return false;
        }
        return rpc_encode_unsigned(buffer, 3, length) &&
               rpc_buffer_append(buffer, string, length);
    }
    if (JS_GetClassID(ctx, value_ref->val) == JS_CLASS_BYTE_SPAN_SOURCE ||
        JS_GetClassID(ctx, value_ref->val) == JS_CLASS_BITMAP_SPAN_SOURCE) {
        size_t length = 0;
        if (buffer->has_stream ||
            !esp32_mquickjs_byte_span_source_known_length(ctx, value_ref->val, &length) ||
            length > ESP32_MQUICKJS_RPC_STREAM_BYTES ||
            !rpc_encode_unsigned(buffer, 2, length)) {
            if (!JS_HasException(ctx)) {
                JS_ThrowTypeError(
                    ctx,
                    "RPCCodec.encode() requires one final ByteSpanSource with a known length");
            }
            return false;
        }
        buffer->has_stream = true;
        buffer->stream_length = length;
        *JS_AddGCRef(ctx, &buffer->stream_ref) = value_ref->val;
        buffer->stream_rooted = true;
        buffer->sealed = true;
        return true;
    }
    if (JS_GetClassID(ctx, value_ref->val) == JS_CLASS_BYTE_VIEW) {
        const uint8_t *data = NULL;
        size_t length = 0;
        bool ok;
        if (!esp32_mquickjs_byte_view_acquire_read(ctx, value_ref->val, "RPCCodec.encode()",
                                                   &data, &length)) {
            return false;
        }
        ok = rpc_encode_unsigned(buffer, 2, length) &&
             rpc_buffer_append(buffer, data, length);
        esp32_mquickjs_byte_view_release_read(ctx, value_ref->val);
        return ok;
    }
    if (JS_IsArray(ctx, value_ref->val)) {
        return rpc_encode_array(ctx, codec, value_ref, buffer, depth,
                                string_keys_allowed);
    }
    if (JS_GetClassID(ctx, value_ref->val) == JS_CLASS_OBJECT) {
        return rpc_encode_map(ctx, codec, value_ref, buffer, depth,
                              string_keys_allowed);
    }
    JS_ThrowTypeError(ctx, "RPCCodec.encode() payload contains an unsupported value");
    return false;
}

static bool rpc_decode_unsigned(const uint8_t *data,
                                size_t length,
                                size_t *offset,
                                uint8_t additional,
                                uint64_t *out)
{
    size_t bytes;
    size_t i;
    uint64_t value = 0;
    uint64_t minimum;
    if (additional < 24U) {
        *out = additional;
        return true;
    }
    if (additional == 24U) { bytes = 1; minimum = 24U; }
    else if (additional == 25U) { bytes = 2; minimum = 256U; }
    else if (additional == 26U) { bytes = 4; minimum = 65536U; }
    else if (additional == 27U) { bytes = 8; minimum = UINT64_C(4294967296); }
    else return false;
    if (bytes > length - *offset) return false;
    for (i = 0; i < bytes; ++i) value = (value << 8U) | data[(*offset)++];
    if (value < minimum) return false;
    *out = value;
    return true;
}

