99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_rpc.c
static JSValue rpc_decode_value(JSContext *ctx,
                                const rpc_codec_slot_t *codec,
                                const uint8_t *data,
                                size_t length,
                                size_t logical_length,
                                size_t *offset,
                                unsigned int depth,
                                bool string_keys_allowed,
                                JSValue stream_value,
                                bool *stream_used);

static JSValue rpc_decode_array(JSContext *ctx,
                                const rpc_codec_slot_t *codec,
                                const uint8_t *data,
                                size_t length,
                                size_t logical_length,
                                size_t *offset,
                                uint64_t count,
                                unsigned int depth,
                                bool string_keys_allowed,
                                JSValue stream_value,
                                bool *stream_used)
{
    JSGCRef array_ref;
    JSValue *array = JS_PushGCRef(ctx, &array_ref);
    uint64_t i;
    *array = JS_NewArray(ctx, 0);
    if (JS_IsException(*array) || count > UINT32_MAX) goto failed;
    for (i = 0; i < count; ++i) {
        JSGCRef item_ref;
        JSValue *item = JS_PushGCRef(ctx, &item_ref);
        *item = rpc_decode_value(ctx, codec, data, length, logical_length, offset,
                                 depth + 1U, string_keys_allowed,
                                 stream_value, stream_used);
        if (JS_IsException(*item) ||
            JS_IsException(JS_SetPropertyUint32(ctx, *array, (uint32_t)i, *item))) {
            JS_PopGCRef(ctx, &item_ref);
            goto failed;
        }
        JS_PopGCRef(ctx, &item_ref);
    }
    return JS_PopGCRef(ctx, &array_ref);
failed:
    JS_PopGCRef(ctx, &array_ref);
    return JS_EXCEPTION;
}

static bool rpc_key_order(const uint8_t *previous,
                          size_t previous_len,
                          const uint8_t *current,
                          size_t current_len)
{
    if (previous_len == 0) return true;
    if (previous_len != current_len) return previous_len < current_len;
    return memcmp(previous, current, current_len) < 0;
}

static JSValue rpc_decode_map(JSContext *ctx,
                              const rpc_codec_slot_t *codec,
                              const uint8_t *data,
                              size_t length,
                              size_t logical_length,
                              size_t *offset,
                              uint64_t count,
                              unsigned int depth,
                              bool string_keys_allowed,
                              JSValue stream_value,
                              bool *stream_used)
{
    JSGCRef object_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);
    size_t previous_key_start = 0;
    size_t previous_key_len = 0;
    uint64_t i;
    *object = JS_NewObject(ctx);
    if (JS_IsException(*object) || count > 1024U) goto failed;
    for (i = 0; i < count; ++i) {
        size_t key_start = *offset;
        uint8_t initial;
        uint8_t major;
        uint8_t additional;
        uint64_t raw;
        bool dynamic_field = false;
        const char *field = NULL;
        char *owned_key = NULL;
        const char *key;
        size_t key_len;
        JSGCRef item_ref;
        JSValue *item;

        if (*offset >= length) goto failed;
        initial = data[(*offset)++];
        major = initial >> 5U;
        additional = initial & 0x1fU;
        if (major == 0) {
            if (!rpc_decode_unsigned(data, length, offset, additional, &raw) ||
                codec == NULL || raw >= codec->field_count) goto failed;
            field = codec->fields[raw];
            dynamic_field = rpc_field_is_dynamic(codec, (uint32_t)raw);
            key = field;
        } else if (major == 3 && string_keys_allowed) {
            if (!rpc_decode_unsigned(data, length, offset, additional, &raw) ||
                raw > length - *offset) goto failed;
            owned_key = malloc((size_t)raw + 1U);
            if (owned_key == NULL) {
                JS_ThrowOutOfMemory(ctx);
                goto failed;
            }
            memcpy(owned_key, data + *offset, (size_t)raw);
            owned_key[raw] = '\0';
            *offset += (size_t)raw;
            key = owned_key;
        } else goto failed;
        key_len = *offset - key_start;
        if (previous_key_len != 0 &&
            !rpc_key_order(data + previous_key_start, previous_key_len,
                           data + key_start, key_len)) {
            free(owned_key);
            goto failed;
        }
        previous_key_start = key_start;
        previous_key_len = key_len;
        item = JS_PushGCRef(ctx, &item_ref);
        *item = rpc_decode_value(
            ctx, codec, data, length, logical_length, offset, depth + 1U,
            string_keys_allowed || dynamic_field, stream_value, stream_used);
        if (JS_IsException(*item) ||
            JS_IsException(JS_SetPropertyStr(ctx, *object, key, *item))) {
            JS_PopGCRef(ctx, &item_ref);
            free(owned_key);
            goto failed;
        }
        JS_PopGCRef(ctx, &item_ref);
        free(owned_key);
    }
    return JS_PopGCRef(ctx, &object_ref);
failed:
    if (!JS_HasException(ctx)) {
        JS_ThrowTypeError(ctx, "RPCDecoder.feed() received invalid deterministic CBOR");
    }
    JS_PopGCRef(ctx, &object_ref);
    return JS_EXCEPTION;
}

static JSValue rpc_decode_value(JSContext *ctx,
                                const rpc_codec_slot_t *codec,
                                const uint8_t *data,
                                size_t length,
                                size_t logical_length,
                                size_t *offset,
                                unsigned int depth,
                                bool string_keys_allowed,
                                JSValue stream_value,
                                bool *stream_used)
{
    uint8_t initial;
    uint8_t major;
    uint8_t additional;
    uint64_t value;
    if (depth > RPC_CBOR_DEPTH || *offset >= length) goto invalid;
    initial = data[(*offset)++];
    major = initial >> 5U;
    additional = initial & 0x1fU;
    if (major == 0 || major == 1) {
        double number;
        if (!rpc_decode_unsigned(data, length, offset, additional, &value) ||
            value > UINT64_C(9007199254740991)) goto invalid;
        number = major == 0 ? (double)value : -1.0 - (double)value;
        return JS_NewFloat64(ctx, number);
    }
    if (major == 2 || major == 3) {
        if (!rpc_decode_unsigned(data, length, offset, additional, &value)) goto invalid;
        if (value > length - *offset) {
            if (major != 2 || JS_IsUndefined(stream_value) || stream_used == NULL ||
                *stream_used || *offset != length ||
                value != logical_length - length) goto invalid;
            *stream_used = true;
            *offset = logical_length;
            return stream_value;
        }
        if (major == 3) {
            JSValue result;
            result = JS_NewStringLen(ctx, (const char *)data + *offset, (size_t)value);
            *offset += (size_t)value;
            return result;
        } else {
            uint8_t *copy = value == 0 ? NULL : malloc((size_t)value);
            if (value != 0 && copy == NULL) return JS_ThrowOutOfMemory(ctx);
            if (value != 0) memcpy(copy, data + *offset, (size_t)value);
            *offset += (size_t)value;
            return esp32_mquickjs_new_owned_byte_view(ctx, copy, (size_t)value);
        }
    }
    if (major == 4 || major == 5) {
        if (!rpc_decode_unsigned(data, length, offset, additional, &value)) goto invalid;
        return major == 4
                   ? rpc_decode_array(ctx, codec, data, length, logical_length,
                                      offset, value, depth, string_keys_allowed,
                                      stream_value, stream_used)
                   : rpc_decode_map(ctx, codec, data, length, logical_length,
                                    offset, value, depth, string_keys_allowed,
                                    stream_value,
                                    stream_used);
    }
    if (major == 7) {
        if (additional == 20U) return JS_NewBool(false);
        if (additional == 21U) return JS_NewBool(true);
        if (additional == 22U) return JS_NULL;
        if (additional == 27U) {
            union { uint64_t bits; double number; } raw = {0};
            size_t i;
            if (8U > length - *offset) goto invalid;
            for (i = 0; i < 8; ++i) raw.bits = (raw.bits << 8U) | data[(*offset)++];
            if (!isfinite(raw.number)) goto invalid;
            return JS_NewFloat64(ctx, raw.number);
        }
    }
invalid:
    return JS_ThrowTypeError(ctx, "RPCDecoder.feed() received invalid deterministic CBOR");
}

