99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_rpc.c
static JSValue rpc_decode_payload(JSContext *ctx,
                                  const rpc_codec_slot_t *codec,
                                  const uint8_t *data,
                                  size_t length,
                                  size_t logical_length,
                                  JSValue stream_value)
{
    CborParser parser;
    CborValue root;
    CborError validation_error;
    uint32_t validation_flags = CborValidateUtf8;
    size_t offset = 0;
    bool stream_used = false;
    JSValue result;
    if (cbor_parser_init(data, length, 0, &parser, &root) != CborNoError) {
        return JS_ThrowTypeError(ctx, "RPCDecoder.feed() received malformed CBOR");
    }
    if (logical_length == length) {
        validation_flags |= (uint32_t)CborValidateCompleteData;
    }
    /* Text well-formedness is part of the CBOR wire type, not product policy. */
    validation_error = cbor_value_validate(&root, validation_flags);
    if ((logical_length == length && validation_error != CborNoError) ||
        (logical_length != length &&
         validation_error != CborErrorUnexpectedEOF)) {
        if (validation_error == CborErrorInvalidUtf8TextString) {
            return JS_ThrowTypeError(ctx,
                                     "RPCDecoder.feed() received invalid CBOR text");
        }
        return JS_ThrowTypeError(ctx, "RPCDecoder.feed() received malformed CBOR");
    }
    result = rpc_decode_value(ctx, codec, data, length, logical_length, &offset, 0,
                              codec->allow_string_keys, stream_value,
                              &stream_used);
    if (JS_IsException(result)) return result;
    if (offset != logical_length ||
        (logical_length != length && !stream_used) ||
        (logical_length == length && stream_used)) {
        return JS_ThrowTypeError(ctx, "RPCDecoder.feed() received trailing CBOR data");
    }
    return result;
}

static void rpc_codec_cleanup(rpc_codec_slot_t *codec)
{
    size_t i;
    uint32_t generation;

    if (codec == NULL) {
        return;
    }
    generation = codec->generation;
    for (i = 0; i < codec->field_count; ++i) {
        free(codec->fields[i]);
    }
    free(codec->fields);
    free(codec->dynamic_fields);
    memset(codec, 0, sizeof(*codec));
    codec->generation = generation;
}

static rpc_codec_slot_t *rpc_codec_from_value(JSContext *ctx,
                                               JSValue value,
                                               const char *api_name)
{
    rpc_handle_ref_t *ref;
    rpc_codec_slot_t *codec;

    if (JS_GetClassID(ctx, value) != JS_CLASS_RPC_CODEC ||
        (ref = JS_GetOpaque(ctx, value)) == NULL ||
        ref->slot >= RPC_CODEC_SLOTS) {
        JS_ThrowTypeError(ctx, "%s expects an RPCCodec object", api_name);
        return NULL;
    }
    codec = &s_rpc_codecs[ref->slot];
    if (!codec->used || codec->generation != ref->generation ||
        codec->close_pending) {
        JS_ThrowReferenceError(ctx, "%s cannot use a closed or stale RPCCodec",
                               api_name);
        return NULL;
    }
    return codec;
}

static JSValue rpc_new_handle(JSContext *ctx,
                              int class_id,
                              uint8_t slot,
                              uint32_t generation)
{
    JSGCRef object_ref;
    JSValue *object = JS_PushGCRef(ctx, &object_ref);
    rpc_handle_ref_t *ref;

    *object = JS_NewObjectClassUser(ctx, class_id);
    if (JS_IsException(*object)) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_EXCEPTION;
    }
    ref = calloc(1, sizeof(*ref));
    if (ref == NULL) {
        JS_PopGCRef(ctx, &object_ref);
        return JS_ThrowOutOfMemory(ctx);
    }
    ref->slot = slot;
    ref->generation = generation;
    JS_SetOpaque(ctx, *object, ref);
    return JS_PopGCRef(ctx, &object_ref);
}

static bool rpc_codec_copy_fields(JSContext *ctx,
                                  rpc_codec_slot_t *codec,
                                  JSGCRef *fields_ref)
{
    JSGCRef length_ref;
    JSValue *length_value = JS_PushGCRef(ctx, &length_ref);
    uint32_t count;
    uint32_t i;
    size_t total_bytes = 0;

    *length_value = JS_GetPropertyStr(ctx, fields_ref->val, "length");
    if (!JS_IsArray(ctx, fields_ref->val) || JS_IsException(*length_value) ||
        JS_ToUint32(ctx, &count, *length_value) != 0 ||
        count == 0 || count > RPC_CODEC_FIELDS) {
        JS_PopGCRef(ctx, &length_ref);
        JS_ThrowTypeError(ctx,
                          "rpc.createCodec() fields must be a non-empty bounded array");
        return false;
    }
    JS_PopGCRef(ctx, &length_ref);
    codec->fields = calloc(count, sizeof(*codec->fields));
    codec->dynamic_fields = calloc(count, sizeof(*codec->dynamic_fields));
    if (codec->fields == NULL || codec->dynamic_fields == NULL) {
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    codec->field_count = count;
    for (i = 0; i < count; ++i) {
        JSGCRef field_ref;
        JSValue *field_value = JS_PushGCRef(ctx, &field_ref);
        JSCStringBuf field_buf;
        const char *field;
        size_t field_len = 0;
        uint32_t previous;

        *field_value = JS_GetPropertyUint32(ctx, fields_ref->val, i);
        field = JS_IsString(ctx, *field_value)
                    ? JS_ToCStringLen(ctx, &field_len, *field_value, &field_buf)
                    : NULL;
        if (field == NULL || field_len == 0 || field_len > RPC_CODEC_FIELD_BYTES ||
            strlen(field) != field_len ||
            field_len > RPC_CODEC_TOTAL_FIELD_BYTES - total_bytes) {
            JS_PopGCRef(ctx, &field_ref);
            JS_ThrowTypeError(ctx,
                              "rpc.createCodec() fields must contain bounded unique strings");
            return false;
        }
        for (previous = 0; previous < i; ++previous) {
            if (strcmp(codec->fields[previous], field) == 0) {
                JS_PopGCRef(ctx, &field_ref);
                JS_ThrowTypeError(ctx,
                                  "rpc.createCodec() fields must contain bounded unique strings");
                return false;
            }
        }
        codec->fields[i] = malloc(field_len + 1U);
        if (codec->fields[i] == NULL) {
            JS_PopGCRef(ctx, &field_ref);
            JS_ThrowOutOfMemory(ctx);
            return false;
        }
        memcpy(codec->fields[i], field, field_len + 1U);
        total_bytes += field_len;
        JS_PopGCRef(ctx, &field_ref);
    }
    return true;
}

static bool rpc_codec_mark_dynamic_fields(JSContext *ctx,
                                          rpc_codec_slot_t *codec,
                                          JSGCRef *dynamic_ref)
{
    JSGCRef length_ref;
    JSValue *length_value;
    uint32_t count;
    uint32_t i;

    if (JS_IsUndefined(dynamic_ref->val)) {
        return true;
    }
    length_value = JS_PushGCRef(ctx, &length_ref);
    *length_value = JS_GetPropertyStr(ctx, dynamic_ref->val, "length");
    if (!JS_IsArray(ctx, dynamic_ref->val) || JS_IsException(*length_value) ||
        JS_ToUint32(ctx, &count, *length_value) != 0 ||
        count > codec->field_count) {
        JS_PopGCRef(ctx, &length_ref);
        JS_ThrowTypeError(ctx,
                          "rpc.createCodec() dynamicFields must be a bounded array");
        return false;
    }
    JS_PopGCRef(ctx, &length_ref);
    for (i = 0; i < count; ++i) {
        JSGCRef field_ref;
        JSValue *field_value = JS_PushGCRef(ctx, &field_ref);
        JSCStringBuf field_buf;
        const char *field;
        uint32_t field_id;

        *field_value = JS_GetPropertyUint32(ctx, dynamic_ref->val, i);
        field = JS_IsString(ctx, *field_value)
                    ? JS_ToCString(ctx, *field_value, &field_buf)
                    : NULL;
        if (field == NULL || rpc_field_id(codec, field, &field_id) != 0 ||
            codec->dynamic_fields[field_id]) {
            JS_PopGCRef(ctx, &field_ref);
            JS_ThrowTypeError(ctx,
                              "rpc.createCodec() dynamicFields must name unique fields");
            return false;
        }
        codec->dynamic_fields[field_id] = true;
        JS_PopGCRef(ctx, &field_ref);
    }
    return true;
}

JSValue js_rpc_create_codec(JSContext *ctx,
                            JSValue *this_val,
                            int argc,
                            JSValue *argv)
{
    rpc_codec_slot_t *codec = NULL;
    JSGCRef fields_ref;
    JSGCRef dynamic_ref;
    JSGCRef directory_ref;
    JSGCRef string_keys_ref;
    JSValue *fields = JS_PushGCRef(ctx, &fields_ref);
    JSValue *dynamic_fields = JS_PushGCRef(ctx, &dynamic_ref);
    JSValue *stream_directory = JS_PushGCRef(ctx, &directory_ref);
    JSValue *string_keys = JS_PushGCRef(ctx, &string_keys_ref);
    size_t slot;
    JSValue result = JS_EXCEPTION;

    (void)this_val;
    if (argc != 1 || JS_GetClassID(ctx, argv[0]) != JS_CLASS_OBJECT ||
        JS_IsArray(ctx, argv[0])) {
        JS_ThrowTypeError(ctx, "rpc.createCodec(options) expects an object");
        goto done;
    }
    for (slot = 0; slot < RPC_CODEC_SLOTS; ++slot) {
        if (!s_rpc_codecs[slot].used) {
            uint32_t generation = s_rpc_codecs[slot].generation + 1U;

            if (generation == 0) {
                generation = 1;
            }
            codec = &s_rpc_codecs[slot];
            memset(codec, 0, sizeof(*codec));
            codec->generation = generation;
            codec->used = true;
            break;
        }
    }
    if (codec == NULL) {
        JS_ThrowInternalError(ctx, "rpc.createCodec() has no free codec slot");
        goto done;
    }
    *fields = JS_GetPropertyStr(ctx, argv[0], "fields");
    *dynamic_fields = JS_GetPropertyStr(ctx, argv[0], "dynamicFields");
    *stream_directory = JS_GetPropertyStr(ctx, argv[0], "streamDirectory");
    *string_keys = JS_GetPropertyStr(ctx, argv[0], "allowStringKeys");
    if (JS_IsException(*fields) || JS_IsException(*dynamic_fields) ||
        JS_IsException(*stream_directory) || JS_IsException(*string_keys) ||
        !rpc_codec_copy_fields(ctx, codec, &fields_ref) ||
        !rpc_codec_mark_dynamic_fields(ctx, codec, &dynamic_ref)) {
        goto failed;
    }
    if (!JS_IsUndefined(*string_keys)) {
        if (!JS_IsBool(*string_keys)) {
            JS_ThrowTypeError(ctx, "rpc.createCodec() allowStringKeys must be boolean");
            goto failed;
        }
        codec->allow_string_keys = JS_VALUE_GET_SPECIAL_VALUE(*string_keys) != 0;
    }
    if (!JS_IsUndefined(*stream_directory)) {
        JSCStringBuf directory_buf;
        size_t directory_len = 0;
        const char *directory = JS_IsString(ctx, *stream_directory)
                                    ? JS_ToCStringLen(ctx, &directory_len,
                                                     *stream_directory,
                                                     &directory_buf)
                                    : NULL;
        if (directory == NULL || directory_len == 0 ||
            directory_len >= sizeof(codec->stream_directory) ||
            strlen(directory) != directory_len) {
            JS_ThrowTypeError(ctx,
                              "rpc.createCodec() streamDirectory must be a bounded path");
            goto failed;
        }
        while (directory_len > 1U && directory[directory_len - 1U] == '/') {
            directory_len--;
        }
        memcpy(codec->stream_directory, directory, directory_len);
        codec->stream_directory[directory_len] = '\0';
    }
    result = rpc_new_handle(ctx, JS_CLASS_RPC_CODEC, (uint8_t)slot,
                            codec->generation);
    if (JS_IsException(result)) {
        goto failed;
    }
    goto done;

failed:
    rpc_codec_cleanup(codec);
done:
    JS_PopGCRef(ctx, &string_keys_ref);
    JS_PopGCRef(ctx, &directory_ref);
    JS_PopGCRef(ctx, &dynamic_ref);
    JS_PopGCRef(ctx, &fields_ref);
    return result;
}

JSValue js_rpc_codec_close(JSContext *ctx,
                           JSValue *this_val,
                           int argc,
                           JSValue *argv)
{
    rpc_handle_ref_t *ref;
    rpc_codec_slot_t *codec;

    (void)argc;
    (void)argv;
    if (this_val == NULL || JS_GetClassID(ctx, *this_val) != JS_CLASS_RPC_CODEC) {
        return JS_ThrowTypeError(ctx, "RPCCodec.close() expects an RPCCodec object");
    }
    ref = JS_GetOpaque(ctx, *this_val);
    if (ref == NULL) {
        return JS_FALSE;
    }
    codec = rpc_codec_from_value(ctx, *this_val, "RPCCodec.close()");
    if (codec == NULL) {
        return JS_EXCEPTION;
    }
    if (codec->decoders != 0) {
        return JS_ThrowReferenceError(ctx,
                                      "RPCCodec.close() codec still has active decoders");
    }
    rpc_codec_cleanup(codec);
    JS_SetOpaque(ctx, *this_val, NULL);
    free(ref);
    return JS_NewBool(true);
}

JSValue js_rpc_codec_constructor(JSContext *ctx,
                                 JSValue *this_val,
                                 int argc,
                                 JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    return JS_ThrowTypeError(ctx, "RPCCodec cannot be constructed directly");
}

void js_rpc_codec_finalizer(JSContext *ctx, void *opaque)
{
    rpc_handle_ref_t *ref = opaque;
    rpc_codec_slot_t *codec;

    (void)ctx;
    if (ref == NULL || ref->slot >= RPC_CODEC_SLOTS) {
        free(ref);
        return;
    }
    codec = &s_rpc_codecs[ref->slot];
    if (codec->used && codec->generation == ref->generation) {
        if (codec->decoders == 0) {
            rpc_codec_cleanup(codec);
        } else {
            codec->close_pending = true;
        }
    }
    free(ref);
}

static rpc_decoder_slot_t *rpc_decoder_from_value(JSContext *ctx,
                                                   JSValue value,
                                                   const char *api_name)
{
    rpc_handle_ref_t *ref;
    rpc_decoder_slot_t *decoder;

