99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_rpc.c
    if (JS_GetClassID(ctx, value) != JS_CLASS_RPC_DECODER ||
        (ref = JS_GetOpaque(ctx, value)) == NULL ||
        ref->slot >= RPC_DECODER_SLOTS) {
        JS_ThrowTypeError(ctx, "%s expects an RPCDecoder object", api_name);
        return NULL;
    }
    decoder = &s_rpc_decoders[ref->slot];
    if (!decoder->used || decoder->generation != ref->generation) {
        JS_ThrowReferenceError(
            ctx, "%s cannot use a closed or stale RPCDecoder", api_name);
        return NULL;
    }
    return decoder;
}

static void rpc_decoder_cleanup(rpc_decoder_slot_t *slot)
{
    rpc_codec_slot_t *codec;
    uint32_t generation;

    if (slot == NULL || !slot->used) {
        return;
    }
    codec = slot->codec;
    generation = slot->generation;
    rpc_decoder_stream_cleanup(slot);
    esp32_mquickjs_rpc_wire_decoder_reset(slot->wire);
    esp32_mquickjs_memory_payload_free(slot->wire);
    memset(slot, 0, sizeof(*slot));
    slot->generation = generation;
    if (codec != NULL && codec->decoders != 0) {
        codec->decoders--;
    }
    if (codec != NULL && codec->close_pending && codec->decoders == 0) {
        rpc_codec_cleanup(codec);
    }
}

static bool rpc_decoder_stream_begin(rpc_decoder_slot_t *slot,
                                     uint32_t request_id,
                                     size_t expected)
{
    int path_length;
    size_t codec_id;
    size_t slot_id;

    if (slot == NULL || slot->codec == NULL ||
        slot->codec->stream_directory[0] == '\0' ||
        slot->stream_file != NULL || slot->stream_path[0] != '\0') {
        return false;
    }
    codec_id = (size_t)(slot->codec - s_rpc_codecs) + 1U;
    slot_id = (size_t)(slot - s_rpc_decoders) + 1U;
    path_length = snprintf(slot->stream_path, sizeof(slot->stream_path),
                           "%s%s.esp32qjs-rpc-%u-%u-%08lx",
                           slot->codec->stream_directory,
                           strcmp(slot->codec->stream_directory, "/") == 0 ? "" : "/",
                           (unsigned)codec_id,
                           (unsigned)slot_id, (unsigned long)request_id);
    if (path_length <= 0 || (size_t)path_length >= sizeof(slot->stream_path)) {
        slot->stream_path[0] = '\0';
        return false;
    }
    unlink(slot->stream_path);
    slot->stream_file = fopen(slot->stream_path, "wb");
    if (slot->stream_file == NULL) {
        slot->stream_path[0] = '\0';
        return false;
    }
    slot->stream_expected = expected;
    slot->stream_received = 0;
    slot->stream_crc_state = UINT32_C(0xffffffff);
    return true;
}

static bool rpc_feed_stream(void *opaque,
                            const esp32_mquickjs_rpc_wire_stream_chunk_t *chunk)
{
    rpc_feed_context_t *feed = opaque;
    rpc_decoder_slot_t *slot = feed->slot;

    if (feed->failed || chunk == NULL || slot == NULL) {
        return false;
    }
    if (chunk->first && !rpc_decoder_stream_begin(
            slot, chunk->request_id, chunk->stream_len)) {
        feed->failed = true;
        return false;
    }
    if (slot->stream_file == NULL || slot->stream_expected != chunk->stream_len ||
        slot->stream_received != chunk->offset ||
        chunk->data_len > slot->stream_expected - slot->stream_received ||
        fwrite(chunk->data, 1, chunk->data_len, slot->stream_file) != chunk->data_len) {
        feed->failed = true;
        rpc_decoder_stream_cleanup(slot);
        return false;
    }
    slot->stream_crc_state = esp32_mquickjs_rpc_crc32_update(
        slot->stream_crc_state, chunk->data, chunk->data_len);
    slot->stream_received += chunk->data_len;
    if (chunk->last) {
        if (slot->stream_received != slot->stream_expected ||
            fflush(slot->stream_file) != 0 || fclose(slot->stream_file) != 0) {
            slot->stream_file = NULL;
            feed->failed = true;
            rpc_decoder_stream_cleanup(slot);
            return false;
        }
        slot->stream_file = NULL;
    }
    return true;
}

static void rpc_feed_message(void *opaque,
                             const esp32_mquickjs_rpc_wire_message_t *message)
{
    rpc_feed_context_t *feed = opaque;
    JSGCRef entry_ref;
    JSGCRef payload_ref;
    JSGCRef source_ref;
    JSValue *entry;
    JSValue *payload;
    JSValue *source;
    bool streamed;
    if (feed->failed) return;
    entry = JS_PushGCRef(feed->ctx, &entry_ref);
    payload = JS_PushGCRef(feed->ctx, &payload_ref);
    source = JS_PushGCRef(feed->ctx, &source_ref);
    *entry = JS_NewObject(feed->ctx);
    *source = JS_UNDEFINED;
    streamed = (message->flags & ESP32_MQUICKJS_RPC_FLAG_STREAM) != 0;
    if (streamed) {
        rpc_decoder_slot_t *slot = feed->slot;
        if (message->stream_len == 0 && slot->stream_path[0] == '\0' &&
            !rpc_decoder_stream_begin(slot, message->request_id, 0)) {
            feed->failed = true;
        }
        if (!feed->failed && slot->stream_file != NULL) {
            if (fflush(slot->stream_file) != 0 || fclose(slot->stream_file) != 0) {
                feed->failed = true;
            }
            slot->stream_file = NULL;
        }
        if (!feed->failed &&
            (slot->stream_received != message->stream_len ||
             slot->stream_path[0] == '\0')) {
            feed->failed = true;
        }
        if (!feed->failed) {
            *source = rpc_new_file_source(
                feed->ctx, slot->stream_path, slot->stream_received, true, true,
                slot->stream_crc_state ^ UINT32_C(0xffffffff));
            if (!JS_IsException(*source)) {
                slot->stream_path[0] = '\0';
                slot->stream_received = 0;
                slot->stream_expected = 0;
            }
        }
    }
    *payload = feed->failed || JS_IsException(*source)
        ? JS_EXCEPTION
        : rpc_decode_payload(
            feed->ctx, feed->slot->codec, message->payload,
            message->payload_len, message->logical_len, *source);
    if (JS_IsException(*entry) || JS_IsException(*payload) ||
        !esp32_mquickjs_set_property_ref(feed->ctx, entry, "opcode",
                                         JS_NewUint32(feed->ctx, message->opcode)) ||
        !esp32_mquickjs_set_property_ref(feed->ctx, entry, "requestId",
                                         JS_NewUint32(feed->ctx, message->request_id)) ||
        !esp32_mquickjs_set_property_ref(feed->ctx, entry, "flags",
                                         JS_NewUint32(feed->ctx, message->flags)) ||
        !esp32_mquickjs_set_property_ref(feed->ctx, entry, "logicalLength",
                                         JS_NewUint32(feed->ctx, message->logical_len)) ||
        !esp32_mquickjs_set_property_ref(feed->ctx, entry, "payload", *payload) ||
        JS_IsException(JS_SetPropertyUint32(feed->ctx, *feed->messages,
                                            feed->message_index++, *entry))) {
        feed->failed = true;
    }
    JS_PopGCRef(feed->ctx, &source_ref);
    JS_PopGCRef(feed->ctx, &payload_ref);
    JS_PopGCRef(feed->ctx, &entry_ref);
}

static void rpc_feed_error(void *opaque, esp32_mquickjs_rpc_wire_error_t error)
{
    rpc_feed_context_t *feed = opaque;
    (void)error;
    if (feed != NULL) {
        rpc_decoder_stream_cleanup(feed->slot);
    }
}

JSValue js_rpc_create_decoder(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    rpc_codec_slot_t *codec;
    size_t i;

    (void)argv;
    if (argc != 0 || this_val == NULL ||
        (codec = rpc_codec_from_value(
             ctx, *this_val, "RPCCodec.createDecoder()")) == NULL) {
        return JS_EXCEPTION;
    }
    for (i = 0; i < RPC_DECODER_SLOTS; ++i) {
        if (!s_rpc_decoders[i].used) {
            uint32_t generation = s_rpc_decoders[i].generation + 1U;
            esp32_mquickjs_rpc_wire_decoder_t *wire;
            JSValue result;

            wire = esp32_mquickjs_memory_payload_alloc(
                "rpc.decoder", sizeof(*wire), ESP32_MQUICKJS_MEMORY_EXTERNAL);
            if (wire == NULL) {
                return JS_ThrowOutOfMemory(ctx);
            }

            if (generation == 0) {
                generation = 1;
            }
            memset(&s_rpc_decoders[i], 0, sizeof(s_rpc_decoders[i]));
            s_rpc_decoders[i].generation = generation;
            s_rpc_decoders[i].used = true;
            s_rpc_decoders[i].codec = codec;
            s_rpc_decoders[i].wire = wire;
            codec->decoders++;
            esp32_mquickjs_rpc_wire_decoder_init(s_rpc_decoders[i].wire);
            result = rpc_new_handle(ctx, JS_CLASS_RPC_DECODER, (uint8_t)i,
                                    generation);
            if (JS_IsException(result)) {
                rpc_decoder_cleanup(&s_rpc_decoders[i]);
            }
            return result;
        }
    }
    return JS_ThrowInternalError(
        ctx, "RPCCodec.createDecoder() has no free decoder slot");
}

JSValue js_rpc_decoder_close(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    rpc_handle_ref_t *ref;
    rpc_decoder_slot_t *slot;

    (void)argc;
    (void)argv;
    if (this_val == NULL || JS_GetClassID(ctx, *this_val) != JS_CLASS_RPC_DECODER) {
        return JS_ThrowTypeError(
            ctx, "RPCDecoder.close() expects an RPCDecoder object");
    }
    ref = JS_GetOpaque(ctx, *this_val);
    if (ref == NULL) {
        return JS_FALSE;
    }
    slot = rpc_decoder_from_value(ctx, *this_val, "RPCDecoder.close()");
    if (slot == NULL) {
        return JS_EXCEPTION;
    }
    rpc_decoder_cleanup(slot);
    JS_SetOpaque(ctx, *this_val, NULL);
    free(ref);
    return JS_NewBool(true);
}

