99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_rpc.c
JSValue js_rpc_decoder_constructor(JSContext *ctx,
                                   JSValue *this_val,
                                   int argc,
                                   JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    return JS_ThrowTypeError(ctx, "RPCDecoder cannot be constructed directly");
}

void js_rpc_decoder_finalizer(JSContext *ctx, void *opaque)
{
    rpc_handle_ref_t *ref = opaque;
    rpc_decoder_slot_t *slot;

    (void)ctx;
    if (ref == NULL || ref->slot >= RPC_DECODER_SLOTS) {
        free(ref);
        return;
    }
    slot = &s_rpc_decoders[ref->slot];
    if (slot->used && slot->generation == ref->generation) {
        rpc_decoder_cleanup(slot);
    }
    free(ref);
}

JSValue js_rpc_reset_decoder(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    rpc_decoder_slot_t *slot;

    (void)argv;
    if (argc != 0 || this_val == NULL ||
        (slot = rpc_decoder_from_value(
             ctx, *this_val, "RPCDecoder.reset()")) == NULL) {
        return JS_EXCEPTION;
    }
    rpc_decoder_stream_cleanup(slot);
    esp32_mquickjs_rpc_wire_decoder_reset(slot->wire);
    esp32_mquickjs_rpc_wire_decoder_init(slot->wire);
    return JS_NewBool(true);
}

JSValue js_rpc_decoder_status(JSContext *ctx,
                              JSValue *this_val,
                              int argc,
                              JSValue *argv)
{
    rpc_decoder_slot_t *slot;
    JSGCRef result_ref;
    JSValue *result;

    (void)argv;
    if (argc != 0 || this_val == NULL ||
        (slot = rpc_decoder_from_value(
             ctx, *this_val, "RPCDecoder.status()")) == NULL) {
        return JS_EXCEPTION;
    }
    result = JS_PushGCRef(ctx, &result_ref);
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "open", JS_TRUE) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "messages", JS_NewUint32(ctx, slot->messages)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "errors", JS_NewUint32(ctx, slot->errors)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "streamActive",
            JS_NewBool(slot->stream_file != NULL ||
                       slot->stream_path[0] != '\0')) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "streamReceivedBytes",
            JS_NewUint32(ctx, (uint32_t)slot->stream_received)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "streamExpectedBytes",
            JS_NewUint32(ctx, (uint32_t)slot->stream_expected))) {
        JS_PopGCRef(ctx, &result_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &result_ref);
}

JSValue js_rpc_feed(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    rpc_decoder_slot_t *slot;
    esp32_mquickjs_byte_source_t source;
    uint8_t *owned = NULL;
    JSValue error = JS_UNDEFINED;
    JSGCRef messages_ref;
    JSValue *messages;
    rpc_feed_context_t feed;
    size_t emitted;
    if (argc != 1 || this_val == NULL ||
        (slot = rpc_decoder_from_value(
             ctx, *this_val, "RPCDecoder.feed()")) == NULL) {
        return JS_EXCEPTION;
    }
    if (!esp32_mquickjs_get_byte_source(ctx, argv[0], "RPCDecoder.feed()", &source,
                                        &owned, &error)) {
        return JS_IsUndefined(error) ? JS_EXCEPTION : error;
    }
    messages = JS_PushGCRef(ctx, &messages_ref);
    *messages = JS_NewArray(ctx, 0);
    feed = (rpc_feed_context_t){ .ctx = ctx, .messages = messages, .slot = slot };
    emitted = esp32_mquickjs_rpc_wire_decoder_feed(
        slot->wire, source.data, source.length,
        (uint64_t)(esp_timer_get_time() / 1000), rpc_feed_message,
        rpc_feed_stream,
        rpc_feed_error, &feed);
    esp32_mquickjs_release_byte_source(owned);
    slot->messages += (uint32_t)emitted;
    if (feed.failed || JS_IsException(*messages)) {
        slot->errors++;
        JS_PopGCRef(ctx, &messages_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &messages_ref);
}

static void rpc_encoded_stream_free(rpc_encoded_stream_object_t *stream)
{
    if (stream == NULL) {
        return;
    }
    if (stream->rooted) {
        JS_DeleteGCRef(stream->ctx, &stream->source_ref);
        stream->rooted = false;
    }
    free(stream->prefix);
    free(stream);
}

static bool rpc_encoded_stream_open(JSContext *ctx,
                                    JSValue source_value,
                                    void *opaque,
                                    esp32_mquickjs_byte_span_source_t *out,
                                    JSValue *out_error)
{
    rpc_encoded_stream_object_t *stream = opaque;

    (void)source_value;
    if (stream == NULL || stream->opened || stream->consumed ||
        stream->destroy_requested) {
        *out_error = JS_ThrowReferenceError(
            ctx, "encoded RPC stream is closed or has already been consumed");
        return false;
    }
    if (!esp32_mquickjs_open_byte_span_source(
            ctx, stream->source_ref.val, "RPCCodec.encode() stream",
            &stream->source, out_error)) {
        return false;
    }
    stream->opened = true;
    out->opaque = stream;
    out->next = NULL;
    out->close = NULL;
    return true;
}

static bool rpc_encoded_stream_load_source(JSContext *ctx,
                                           rpc_encoded_stream_object_t *stream)
{
    unsigned empty = 0;

    while (stream->span_offset >= stream->span.length) {
        esp32_mquickjs_byte_span_clear(&stream->span);
        stream->span_offset = 0;
        if (!esp32_mquickjs_byte_span_source_next(ctx, &stream->source,
                                                  &stream->span)) {
            if (!JS_HasException(ctx) &&
                stream->source_produced != stream->source_len) {
                JS_ThrowInternalError(ctx,
                                      "RPCCodec.encode() ByteSpanSource length changed");
            }
            return false;
        }
        if (stream->span.length == 0) {
            if (++empty > 16) {
                JS_ThrowInternalError(
                    ctx, "RPCCodec.encode() ByteSpanSource yielded too many empty spans");
                return false;
            }
            continue;
        }
        if (stream->span.data == NULL ||
            stream->span.length > stream->source_len - stream->source_produced) {
            JS_ThrowInternalError(ctx,
                                  "RPCCodec.encode() ByteSpanSource length changed");
            return false;
        }
    }
    return true;
}

static bool rpc_encoded_stream_next(JSContext *ctx,
                                    void *opaque,
                                    esp32_mquickjs_byte_span_t *out)
{
    rpc_encoded_stream_object_t *stream = opaque;
    size_t segment_len = 0;
    size_t logical_len;
    size_t wire_len = 0;
    uint8_t flags;

    if (stream == NULL || !stream->opened || stream->consumed) {
        JS_ThrowReferenceError(ctx, "encoded RPC stream iterator is closed");
        return false;
    }
    logical_len = stream->prefix_len + stream->source_len;
    if (stream->logical_offset >= logical_len) {
        return false;
    }
    while (segment_len < sizeof(stream->segment) &&
           stream->logical_offset < stream->prefix_len) {
        size_t length = stream->prefix_len - stream->logical_offset;
        if (length > sizeof(stream->segment) - segment_len) {
            length = sizeof(stream->segment) - segment_len;
        }
        memcpy(stream->segment + segment_len,
               stream->prefix + stream->logical_offset, length);
        segment_len += length;
        stream->logical_offset += length;
    }
    while (segment_len < sizeof(stream->segment) &&
           stream->source_produced < stream->source_len) {
        size_t length;
        if (!rpc_encoded_stream_load_source(ctx, stream)) {
            return false;
        }
        length = stream->span.length - stream->span_offset;
        if (length > sizeof(stream->segment) - segment_len) {
            length = sizeof(stream->segment) - segment_len;
        }
        memcpy(stream->segment + segment_len,
               stream->span.data + stream->span_offset, length);
        stream->span_offset += length;
        stream->source_produced += length;
        stream->logical_offset += length;
        segment_len += length;
    }
    flags = stream->flags | ESP32_MQUICKJS_RPC_FLAG_STREAM;
    if (stream->logical_offset == segment_len) {
        flags |= ESP32_MQUICKJS_RPC_FLAG_FIRST;
    }
    if (stream->logical_offset == logical_len) {
        flags |= ESP32_MQUICKJS_RPC_FLAG_LAST;
    }
    if (esp32_mquickjs_rpc_wire_encode_segment(
            stream->opcode, stream->request_id, flags, (uint32_t)logical_len,
            (uint32_t)(stream->logical_offset - segment_len),
            (uint16_t)stream->prefix_len, stream->segment,
            (uint16_t)segment_len, stream->frame, sizeof(stream->frame),
            &wire_len) != ESP32_MQUICKJS_RPC_WIRE_OK) {
        JS_ThrowInternalError(ctx, "RPCCodec.encode() could not frame streamed data");
        return false;
    }
    out->data = stream->frame;
    out->length = wire_len;
    out->owner = JS_UNDEFINED;
    out->dma_capable = false;
    return true;
}

