99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_rpc.c
static void rpc_encoded_stream_close(JSContext *ctx, void *opaque)
{
    rpc_encoded_stream_object_t *stream = opaque;

    if (stream == NULL) {
        return;
    }
    if (stream->opened) {
        esp32_mquickjs_byte_span_source_close(ctx, &stream->source);
        stream->opened = false;
    }
    stream->consumed = true;
    if (stream->destroy_requested) {
        rpc_encoded_stream_free(stream);
    }
}

static bool rpc_encoded_stream_source_open(
    JSContext *ctx,
    JSValue source_value,
    void *opaque,
    esp32_mquickjs_byte_span_source_t *out,
    JSValue *out_error)
{
    if (!rpc_encoded_stream_open(ctx, source_value, opaque, out, out_error)) {
        return false;
    }
    out->next = rpc_encoded_stream_next;
    out->close = rpc_encoded_stream_close;
    return true;
}

static void rpc_encoded_stream_destroy(JSContext *ctx, void *opaque)
{
    rpc_encoded_stream_object_t *stream = opaque;

    if (stream == NULL) {
        return;
    }
    if (stream->opened) {
        stream->destroy_requested = true;
        return;
    }
    (void)ctx;
    rpc_encoded_stream_free(stream);
}

static const esp32_mquickjs_byte_span_source_object_ops_t s_rpc_encoded_stream_ops = {
    .class_id = JS_CLASS_BYTE_SPAN_SOURCE,
    .open = rpc_encoded_stream_source_open,
    .destroy = rpc_encoded_stream_destroy,
};

static JSValue rpc_make_encoded_stream(JSContext *ctx,
                                       uint16_t opcode,
                                       uint32_t request_id,
                                       uint8_t flags,
                                       rpc_buffer_t *payload)
{
    rpc_encoded_stream_object_t *stream = calloc(1, sizeof(*stream));
    JSValue *source;

    if (stream == NULL) {
        rpc_buffer_cleanup(ctx, payload);
        return JS_ThrowOutOfMemory(ctx);
    }
    stream->ctx = ctx;
    stream->opcode = opcode;
    stream->request_id = request_id;
    stream->flags = flags;
    stream->prefix = payload->data;
    payload->data = NULL;
    stream->prefix_len = payload->length;
    stream->source_len = payload->stream_length;
    esp32_mquickjs_byte_span_clear(&stream->span);
    source = JS_AddGCRef(ctx, &stream->source_ref);
    *source = payload->stream_ref.val;
    stream->rooted = true;
    {
        JSValue result = esp32_mquickjs_new_byte_span_source(
            ctx, payload->stream_ref.val, &s_rpc_encoded_stream_ops, stream);
        rpc_buffer_cleanup(ctx, payload);
        return result;
    }
}

JSValue js_rpc_encode(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    rpc_codec_slot_t *codec;
    uint32_t opcode;
    uint32_t request_id;
    uint32_t flags;
    rpc_buffer_t payload;
    JSGCRef frames_ref;
    JSValue *frames;
    size_t offset = 0;
    uint32_t index = 0;
    bool encoded;
    if (argc != 4 || this_val == NULL ||
        (codec = rpc_codec_from_value(
             ctx, *this_val, "RPCCodec.encode()")) == NULL ||
        JS_ToUint32(ctx, &opcode, argv[0]) != 0 || opcode == 0 ||
        opcode > UINT16_MAX || JS_ToUint32(ctx, &request_id, argv[1]) != 0 ||
        JS_ToUint32(ctx, &flags, argv[2]) != 0 ||
        (flags & ~(ESP32_MQUICKJS_RPC_FLAG_RESPONSE |
                   ESP32_MQUICKJS_RPC_FLAG_ERROR)) != 0) {
        return JS_ThrowTypeError(ctx,
                                 "RPCCodec.encode(opcode, requestId, flags, payload) received invalid arguments");
    }
    payload = (rpc_buffer_t){
        0,
    };
    {
        JSGCRef input_ref;
        JSValue *input = JS_PushGCRef(ctx, &input_ref);
        *input = argv[3];
        encoded = rpc_encode_value(ctx, codec, &input_ref, &payload, 0,
                                   codec->allow_string_keys);
        JS_PopGCRef(ctx, &input_ref);
    }
    if (!encoded || payload.failed) {
        rpc_buffer_cleanup(ctx, &payload);
        if (!JS_HasException(ctx)) {
            if (payload.out_of_memory) {
                return JS_ThrowOutOfMemory(ctx);
            }
            return JS_ThrowRangeError(ctx, "RPCCodec.encode() payload exceeds 65536 bytes");
        }
        return JS_EXCEPTION;
    }
    {
        CborParser parser;
        CborValue root;
        CborError validation_error;
        uint32_t validation_flags = CborValidateUtf8;

        if (!payload.has_stream || payload.stream_length == 0) {
            validation_flags |= (uint32_t)CborValidateCompleteData;
        }
        if (cbor_parser_init(payload.data, payload.length, 0, &parser, &root) !=
                CborNoError) {
            rpc_buffer_cleanup(ctx, &payload);
            return JS_ThrowInternalError(ctx,
                                         "RPCCodec.encode() produced invalid CBOR");
        }
        /* Delegate the CBOR text contract to the bundled codec. */
        validation_error = cbor_value_validate(&root, validation_flags);
        if ((!payload.has_stream || payload.stream_length == 0)
                ? validation_error != CborNoError
                : validation_error != CborErrorUnexpectedEOF) {
            rpc_buffer_cleanup(ctx, &payload);
            if (validation_error == CborErrorInvalidUtf8TextString) {
                return JS_ThrowTypeError(
                    ctx, "RPCCodec.encode() text values must be valid CBOR text");
            }
            return JS_ThrowInternalError(ctx,
                                         "RPCCodec.encode() produced invalid CBOR");
        }
    }
    if (payload.has_stream) {
        if (payload.length > ESP32_MQUICKJS_RPC_STREAM_PREFIX_BYTES ||
            payload.length + payload.stream_length > UINT32_MAX) {
            rpc_buffer_cleanup(ctx, &payload);
            return JS_ThrowRangeError(ctx, "RPCCodec.encode() stream exceeds its size limit");
        }
        return rpc_make_encoded_stream(ctx, (uint16_t)opcode, request_id,
                                       (uint8_t)flags, &payload);
    }
    frames = JS_PushGCRef(ctx, &frames_ref);
    *frames = JS_NewArray(ctx, 0);
    do {
        uint16_t segment_len = (uint16_t)((payload.length - offset) >
                ESP32_MQUICKJS_RPC_SEGMENT_BYTES
            ? ESP32_MQUICKJS_RPC_SEGMENT_BYTES : payload.length - offset);
        uint8_t segment_flags = (uint8_t)flags;
        uint8_t *wire = malloc(ESP32_MQUICKJS_RPC_MAX_FRAME_BYTES);
        size_t wire_len = 0;
        JSGCRef view_ref;
        JSValue *view;
        esp32_mquickjs_rpc_wire_error_t wire_error;
        if (wire == NULL) {
            rpc_buffer_cleanup(ctx, &payload);
            JS_PopGCRef(ctx, &frames_ref);
            return JS_ThrowOutOfMemory(ctx);
        }
        if (offset == 0) segment_flags |= ESP32_MQUICKJS_RPC_FLAG_FIRST;
        if (offset + segment_len == payload.length) segment_flags |= ESP32_MQUICKJS_RPC_FLAG_LAST;
        wire_error = esp32_mquickjs_rpc_wire_encode_segment(
            (uint16_t)opcode, request_id, segment_flags, (uint32_t)payload.length,
            (uint32_t)offset, 0, payload.data + offset, segment_len, wire,
            ESP32_MQUICKJS_RPC_MAX_FRAME_BYTES, &wire_len);
        if (wire_error != ESP32_MQUICKJS_RPC_WIRE_OK) {
            free(wire);
            rpc_buffer_cleanup(ctx, &payload);
            JS_PopGCRef(ctx, &frames_ref);
            return JS_ThrowInternalError(ctx, "RPCCodec.encode() wire error: %s",
                                         esp32_mquickjs_rpc_wire_error_name(wire_error));
        }
        view = JS_PushGCRef(ctx, &view_ref);
        *view = esp32_mquickjs_new_owned_byte_view(ctx, wire, wire_len);
        if (JS_IsException(*view) ||
            JS_IsException(JS_SetPropertyUint32(ctx, *frames, index++, *view))) {
            JS_PopGCRef(ctx, &view_ref);
            rpc_buffer_cleanup(ctx, &payload);
            JS_PopGCRef(ctx, &frames_ref);
            return JS_EXCEPTION;
        }
        JS_PopGCRef(ctx, &view_ref);
        offset += segment_len;
    } while (offset < payload.length || (payload.length == 0 && index == 0));
    rpc_buffer_cleanup(ctx, &payload);
    return JS_PopGCRef(ctx, &frames_ref);
}

JSValue js_rpc_bytes(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    esp32_mquickjs_byte_source_t source;
    uint8_t *owned = NULL;
    JSValue error = JS_UNDEFINED;
    uint8_t *copy;
    (void)this_val;
    if (argc != 1 || !esp32_mquickjs_get_byte_source(ctx, argv[0], "rpc.bytes()",
                                                     &source, &owned, &error)) {
        return JS_IsUndefined(error)
                   ? JS_ThrowTypeError(ctx, "rpc.bytes(value) expects byte data")
                   : error;
    }
    if (owned != NULL || source.length == 0) {
        return esp32_mquickjs_new_owned_byte_view(ctx, owned, source.length);
    }
    copy = malloc(source.length);
    if (copy == NULL) return JS_ThrowOutOfMemory(ctx);
    memcpy(copy, source.data, source.length);
    return esp32_mquickjs_new_owned_byte_view(ctx, copy, source.length);
}

JSValue js_rpc_file_source(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    JSCStringBuf path_buf;
    const char *path;
    struct stat info;

    (void)this_val;
    if (argc != 1 || !JS_IsString(ctx, argv[0])) {
        return JS_ThrowTypeError(ctx, "rpc.fileSource(path) expects a file path");
    }
    path = JS_ToCString(ctx, argv[0], &path_buf);
    if (path == NULL) {
        return JS_EXCEPTION;
    }
    if (path[0] == '\0' || stat(path, &info) != 0 ||
        !S_ISREG(info.st_mode) || info.st_size < 0 ||
        (uint64_t)info.st_size > ESP32_MQUICKJS_RPC_STREAM_BYTES) {
        return JS_ThrowTypeError(ctx,
                                 "rpc.fileSource(path) expects a readable regular file");
    }
    return rpc_new_file_source(ctx, path, (size_t)info.st_size, false, false, 0);
}

