99percentpeople/esp32qjs/components/esp32_mquickjs/src/core/esp32_mquickjs_rpc.c
JSValue js_rpc_source_info(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    rpc_file_source_object_t *source;
    JSGCRef result_ref;
    JSValue *result;
    char crc[9];

    (void)this_val;
    if (argc != 1 ||
        (source = esp32_mquickjs_byte_span_source_get_opaque(
             ctx, argv[0], &s_rpc_file_source_ops, "rpc.sourceInfo(source)")) == NULL) {
        return JS_EXCEPTION;
    }
    result = JS_PushGCRef(ctx, &result_ref);
    *result = JS_NewObject(ctx);
    if (source->has_crc32) {
        snprintf(crc, sizeof(crc), "%08lx", (unsigned long)source->crc32);
    }
    if (JS_IsException(*result) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "size", JS_NewUint32(ctx, (uint32_t)source->length)) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "crc32",
            source->has_crc32 ? JS_NewString(ctx, crc) : JS_NULL)) {
        JS_PopGCRef(ctx, &result_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &result_ref);
}

JSValue js_rpc_adopt_file(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    rpc_file_source_object_t *source;
    JSCStringBuf path_buf;
    const char *path;

    (void)this_val;
    if (argc != 2 || !JS_IsString(ctx, argv[1]) ||
        (source = esp32_mquickjs_byte_span_source_get_opaque(
             ctx, argv[0], &s_rpc_file_source_ops, "rpc.adoptFile(source, path)")) == NULL) {
        return JS_EXCEPTION;
    }
    path = JS_ToCString(ctx, argv[1], &path_buf);
    if (path == NULL) {
        return JS_EXCEPTION;
    }
    if (!source->remove_on_destroy || source->opened || source->consumed ||
        source->adopted || source->path == NULL || path[0] == '\0') {
        return JS_ThrowTypeError(ctx, "rpc.adoptFile() expects an unused RPC upload source");
    }
    if (rename(source->path, path) != 0) {
        return JS_ThrowInternalError(ctx, "rpc.adoptFile() could not replace the target");
    }
    source->adopted = true;
    source->remove_on_destroy = false;
    esp32_mquickjs_fs_notify_change(
        ESP32_MQUICKJS_FS_CHANGE_WRITE, path, NULL);
    return JS_NewBool(true);
}

JSValue js_rpc_status(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    JSGCRef result_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref);
    uint32_t active_codecs = 0;
    uint32_t active = 0;
    uint32_t messages = 0;
    uint32_t errors = 0;
    size_t i;
    (void)this_val; (void)argc; (void)argv;
    for (i = 0; i < RPC_DECODER_SLOTS; ++i) {
        if (s_rpc_decoders[i].used) active++;
        messages += s_rpc_decoders[i].messages;
        errors += s_rpc_decoders[i].errors;
    }
    for (i = 0; i < RPC_CODEC_SLOTS; ++i) {
        if (s_rpc_codecs[i].used) active_codecs++;
    }
    *result = JS_NewObject(ctx);
    if (JS_IsException(*result) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "protocol",
                                         JS_NewString(ctx, ESP32_MQUICKJS_RPC_PROTOCOL)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "activeCodecs",
                                         JS_NewUint32(ctx, active_codecs)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "activeDecoders",
                                         JS_NewUint32(ctx, active)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "messages", JS_NewUint32(ctx, messages)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "errors", JS_NewUint32(ctx, errors))) {
        JS_PopGCRef(ctx, &result_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &result_ref);
}

void esp32_mquickjs_deinit_rpc_runtime(void)
{
    size_t i;

    for (i = 0; i < RPC_DECODER_SLOTS; ++i) {
        rpc_decoder_cleanup(&s_rpc_decoders[i]);
    }
    for (i = 0; i < RPC_CODEC_SLOTS; ++i) {
        if (s_rpc_codecs[i].used) {
            rpc_codec_cleanup(&s_rpc_codecs[i]);
        }
    }
}
